app/controllers/commits_controller.rb

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
INSERT INTO "commits" ("sha", "user_id", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sha", "89afac8760341a3ccf4b76815200149cd76a357d"], ["user_id", 5], ["date", "2014-02-26T03:52:25Z"], ["created_at", "2016-03-10 07:35:46.849794"], ["updated_at", "2016-03-10 07:35:46.849794"]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Auanassov Chingiz"], ["email", "auanassov.chingiz@gmail.com"], ["created_at", "2016-03-10 07:33:03.968991"], ["updated_at", "2016-03-10 07:33:03.968991"]]
SELECT "commits".* FROM "commits" WHERE "commits"."user_id" = $1  [["user_id", 1]]
---
  def parse
    logger.info "Parse params #{parse_params}"

    User.destroy_all

    if find_repo
      commits.each do |commit|
        user = find_user(commit)
        if user
          user.commits.create(sha: commit.sha,
              message: commit.commit.message,
              user: user,
              date: commit.commit.author.date)
        end

      end

      @response[:messages] << "#{commits.length} commits loaded"

UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "12"], ["updated_at", "2016-03-10 08:33:56.147197"], ["id", 16]]
---
  def update_author
    logger.info "Update author params #{commit_author_params}"
    if @user and @user.update_attributes(name: commit_author_params[:name])

SELECT "users".* FROM "users"
---
  def find_user_repos
    begin
      @response[:repos] = $github.repos.list(user: parse_params[:user]).map(&:name)

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 AND "users"."email" = $2 LIMIT 1  [["name", "Auanassov Chingiz"], ["email", "auanassov.chingiz@gmail.com"]]
---
  def find_user(commit)
    User.find_or_create_by(name: commit.commit.author.name, email: commit.commit.author.email)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 16]]
---
  def set_user
    @user = User.find(commit_author_params[:id])